Scripts/Firefox/FileUploadPngTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3 r1808647">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(count,1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,0)}</stringProp>
        <longProp name="ThreadGroup.start_time">1514449702000</longProp>
        <longProp name="ThreadGroup.end_time">1514449702000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">Inputdatas.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">MainUrl,username,password</stringProp>
        </CSVDataSet>
        <hashTree/>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Transaction Controller" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <com.googlecode.jmeter.plugins.webdriver.config.FirefoxDriverConfig guiclass="com.googlecode.jmeter.plugins.webdriver.config.gui.FirefoxDriverConfigGui" testclass="com.googlecode.jmeter.plugins.webdriver.config.FirefoxDriverConfig" testname="jp@gc - Firefox Driver Config" enabled="true">
            <stringProp name="WebDriverConfig.proxy_type">SYSTEM</stringProp>
            <intProp name="WebDriverConfig.http_port">8080</intProp>
            <boolProp name="WebDriverConfig.use_http_for_all_protocols">true</boolProp>
            <intProp name="WebDriverConfig.https_port">8080</intProp>
            <intProp name="WebDriverConfig.ftp_port">8080</intProp>
            <intProp name="WebDriverConfig.socks_port">8080</intProp>
            <stringProp name="WebDriverConfig.no_proxy">localhost</stringProp>
            <boolProp name="WebDriverConfig.maximize_browser">true</boolProp>
            <boolProp name="WebDriverConfig.reset_per_iteration">false</boolProp>
            <boolProp name="WebDriverConfig.dev_mode">false</boolProp>
            <boolProp name="FirefoxDriverConfig.general.useragent.override.enabled">false</boolProp>
            <boolProp name="FirefoxDriverConfig.network.negotiate-auth.allow-insecure-ntlm-v1">false</boolProp>
            <collectionProp name="FirefoxDriverConfig.general.extensions"/>
            <collectionProp name="FirefoxDriverConfig.general.preferences"/>
          </com.googlecode.jmeter.plugins.webdriver.config.FirefoxDriverConfig>
          <hashTree/>
          <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="jp@gc - WebDriver Sampler" enabled="true">
            <stringProp name="WebDriverSampler.script">import org.apache.jmeter.services.FileServer;&#xd;
import org.openqa.selenium;&#xd;
import java.time.temporal.ChronoUnit;&#xd;
import java.time.format.DateTimeFormatter;  &#xd;
import java.time.LocalDateTime;   &#xd;
import org.openqa.selenium.WebElement;&#xd;
import org.openqa.selenium.By;&#xd;
import java.io.IOException;&#xd;
import org.apache.commons.io.FileUtils;&#xd;
import org.openqa.selenium.OutputType;&#xd;
import org.openqa.selenium.TakesScreenshot;&#xd;
import org.openqa.selenium.WebDriver;&#xd;
import java.net.InetAddress;&#xd;
import java.net.UnknownHostException;&#xd;
import java.util.concurrent.TimeUnit;&#xd;
import org.openqa.selenium.support.ui.WebDriverWait;&#xd;
import org.openqa.selenium.support.ui.ExpectedConditions;&#xd;
&#xd;
var vars = org.apache.jmeter.threads.JMeterContextService.getContext().getVariables();&#xd;
WebDriverWait wait= new WebDriverWait(WDS.browser,10);&#xd;
vars.put(&quot;Itr&quot;,String.valueOf(&quot;${__BeanShell(vars.getIteration(),)}&quot;));&#xd;
vars.put(&quot;usr&quot;,String.valueOf(&quot;${__threadNum}&quot;));&#xd;
vars.put(&quot;overlay&quot;,&quot;0&quot;);&#xd;
vars.put(&quot;login&quot;,&quot;0&quot;);&#xd;
vars.put(&quot;ErrorMessage&quot;,&quot;0&quot;);&#xd;
vars.put(&quot;logout&quot;,&quot;0&quot;);&#xd;
WDS.sampleResult.sampleStart();&#xd;
//Script Starts from here&#xd;
vars.put(&quot;StartTime&quot;,String.valueOf(LocalDateTime.now()));&#xd;
&#xd;
//Launcing application&#xd;
WDS.browser.get(&quot;${MainUrl}&quot;);&#xd;
&#xd;
//application login process&#xd;
try{&#xd;
wait.until(ExpectedConditions.visibilityOfElementLocated(By.id(&quot;userEmail&quot;))).sendKeys(new String[] {&quot;${username}&quot;});&#xd;
wait.until(ExpectedConditions.visibilityOfElementLocated(By.id(&quot;userPwd&quot;))).sendKeys(new String[] {&quot;${password}&quot;});&#xd;
login=wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//button[@class=&apos;btn btn-mammoth&apos;]&quot;)));&#xd;
startlogin=LocalDateTime.now();&#xd;
login.click();&#xd;
&#xd;
//Overlay starts now&#xd;
TEN_SECONDS=15*1000;&#xd;
WDS.browser.manage().timeouts().implicitlyWait(6, TimeUnit.SECONDS); &#xd;
oldTime=LocalDateTime.now();&#xd;
start=LocalDateTime.now();&#xd;
try{&#xd;
	while(WDS.browser.findElement(By.xpath(&quot;//spinner[@class=&apos;html5spinner ng-scope&apos;]&quot;)).isDisplayed()){&#xd;
    	WDS.log.info(&quot;overlay is there&quot;);	&#xd;
    	Long minutesBetween=ChronoUnit.MILLIS.between(oldTime,LocalDateTime.now());&#xd;
    	if(minutesBetween&gt;TEN_SECONDS){&#xd;
        	WDS.browser.navigate().refresh();&#xd;
        	oldTimeAfterRefresh=LocalDateTime.now();&#xd;
        //again find overlay after refreshing&#xd;
        	try{&#xd;
        		while(WDS.browser.findElement(By.xpath(&quot;//spinner[@class=&apos;html5spinner ng-scope&apos;]&quot;)).isDisplayed()){&#xd;
        		Long minutesBetween=ChronoUnit.MILLIS.between(oldTimeAfterRefresh,LocalDateTime.now());&#xd;
        		if(minutesBetween&gt;TEN_SECONDS){&#xd;
        		break outerloop;&#xd;
        	}&#xd;
                else {&#xd;
                    WDS.log.info(&quot;Overlay is there&quot;);&#xd;
                     }&#xd;
                  }&#xd;
               }&#xd;
            catch(Exception e){&#xd;
                //when there is no overlay in test&#xd;
            	WDS.log.info(&quot;Exception :Overlay is not present After refreshing&quot;);	&#xd;
            	end=LocalDateTime.now();&#xd;
            	Long minutesBetween=ChronoUnit.MILLIS.between(start,end);&#xd;
            	vars.put(&quot;overlay&quot;,String.valueOf(minutesBetween));&#xd;
            	Long minutesBetween=ChronoUnit.MILLIS.between(startlogin,end);&#xd;
            	vars.put(&quot;login&quot;,String.valueOf(minutesBetween));&#xd;
            WDS.log.info(vars.get(&quot;overlay&quot;));&#xd;
        	WDS.log.info(vars.get(&quot;login&quot;));&#xd;
        //Overlay is not present on screen but test should mark as fail,as it required browser refresh to work.&#xd;
                            }&#xd;
                   }&#xd;
               }&#xd;
    //Overlay got invisible now&#xd;
    WDS.log.info(&quot;Overlay is invisible now&quot;);&#xd;
	end=LocalDateTime.now();&#xd;
	Long minutesBetween=ChronoUnit.MILLIS.between(start,end);&#xd;
	vars.put(&quot;overlay&quot;,String.valueOf(minutesBetween));&#xd;
	Long minutesBetween=ChronoUnit.MILLIS.between(startlogin,end);&#xd;
	vars.put(&quot;login&quot;,String.valueOf(minutesBetween));&#xd;
	WDS.log.info(vars.get(&quot;overlay&quot;));&#xd;
    WDS.log.info(vars.get(&quot;login&quot;));&#xd;
}&#xd;
catch(Exception e){&#xd;
    //There is no overlay found&#xd;
	WDS.log.info(&quot;Exception :Overlay element id is not present.&quot;);&#xd;
	end=LocalDateTime.now();&#xd;
	Long minutesBetween=ChronoUnit.MILLIS.between(start,end);&#xd;
	vars.put(&quot;overlay&quot;,String.valueOf(minutesBetween));&#xd;
	Long minutesBetween=ChronoUnit.MILLIS.between(startlogin,end);&#xd;
	vars.put(&quot;login&quot;,String.valueOf(minutesBetween));&#xd;
    WDS.log.info(vars.get(&quot;overlay&quot;));&#xd;
    WDS.log.info(vars.get(&quot;login&quot;));&#xd;
	break outerloop;&#xd;
	}&#xd;
finally{&#xd;
    WDS.log.info(&quot;test&quot;+vars.get(&quot;overlay&quot;));&#xd;
    WDS.log.info(&quot;test&quot;+vars.get(&quot;login&quot;));&#xd;
&#xd;
WDS.sampleResult.sampleEnd();&#xd;
}&#xd;
&#xd;
}catch(Exception e)&#xd;
{&#xd;
    //log.info(&quot;Exception is : &quot; +e);&#xd;
    try {&#xd;
           InetAddress ipAddr = InetAddress.getLocalHost();&#xd;
           ip= String.valueOf(ipAddr.getHostAddress());&#xd;
            } catch (UnknownHostException ex) {&#xd;
                ex.printStackTrace();&#xd;
            }&#xd;
    File src= ((TakesScreenshot)WDS.browser).getScreenshotAs(OutputType.FILE);&#xd;
    try {&#xd;
     // now copy the  screenshot to desired location using copyFile //method&#xd;
        FileUtils.copyFile(src, new File(&quot;Reporting/&quot;+ip+&quot;UploadPng_login&quot;+vars.get(&quot;Itr&quot;)+&quot;i&quot;+vars.get(&quot;usr&quot;)+&quot;u&quot;+&quot;.png&quot;));&#xd;
    }&#xd;
    catch (IOException e)&#xd;
     {&#xd;
       WDS.log.info(&quot;something wrong&quot;);&#xd;
     }&#xd;
 }&#xd;
finally&#xd;
{&#xd;
WDS.log.info(&quot;Comming to finally&quot;);&#xd;
}&#xd;
</stringProp>
            <stringProp name="WebDriverSampler.language">beanshell</stringProp>
          </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
          <hashTree/>
          <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="jp@gc - WebDriver Sampler" enabled="true">
            <stringProp name="WebDriverSampler.script">import org.apache.jmeter.services.FileServer;&#xd;
import org.openqa.selenium;&#xd;
import java.awt.Robot;&#xd;
import java.awt.Toolkit;&#xd;
import java.awt.datatransfer.StringSelection;&#xd;
import java.awt.event.KeyEvent;&#xd;
import org.openqa.selenium.firefox.FirefoxProfile;&#xd;
import java.time.temporal.ChronoUnit;&#xd;
import java.time.format.DateTimeFormatter;  &#xd;
import java.time.LocalDateTime;   &#xd;
import org.openqa.selenium.WebElement;&#xd;
import org.openqa.selenium.By;&#xd;
import java.io.FileReader;&#xd;
import java.io.BufferedReader;&#xd;
import java.io.FileWriter;&#xd;
import java.util.concurrent.TimeUnit;&#xd;
import java.util.ArrayList;&#xd;
import org.testng.asserts.SoftAssert;&#xd;
import java.util.List;&#xd;
import org.openqa.selenium.support.ui.WebDriverWait;&#xd;
import org.openqa.selenium.support.ui.ExpectedConditions;&#xd;
WebDriverWait wait= new WebDriverWait(WDS.browser,360);&#xd;
WDS.sampleResult.sampleStart();&#xd;
try{&#xd;
try{&#xd;
   //Checking for the invisibility of blanck page if there are no data in the application&#xd;
wait.until(ExpectedConditions.invisibilityOfElementLocated(By.xpath(&quot;//div[@class=&apos;no-data&apos;]&quot;)));&#xd;
}catch(Exception e){&#xd;
    //If There is no data in the application uploading a new file.&#xd;
if(WDS.browser.findElement(By.xpath(&quot;//div[@class=&apos;no-data&apos;]&quot;)).isDisplayed()){&#xd;
wait.until(ExpectedConditions.elementToBeClickable(By.xpath(&quot;//ul[@class=&apos;menu-main&apos;]/child::li&quot;))).click();&#xd;
start=LocalDateTime.now();&#xd;
Thread.sleep(5000);&#xd;
file1= WDS.browser.findElement(By.xpath(&quot;//input[contains(@class,&apos;fileSelectHiddenInput&apos;)]&quot;));&#xd;
&#xd;
WDS.browser.executeScript(&quot;document.querySelector(&apos;.fileSelectHiddenInput&apos;).setAttribute(&apos;style&apos;,display=&apos;block&apos;,&apos;opacity:1; width:10px; height:10px; z-index:100&apos;)&quot;,new Object[] {&quot;&quot;});&#xd;
//filelocation=&quot;C:/Users/Deepak/Desktop/MamothPerformanceTest/scale_up_tests-master/test_suites/Test Files/CSVoffice_main.csv&quot;;&#xd;
filelocation=java.lang.System.getProperty(&quot;user.dir&quot;) + &quot;/&quot; + &quot;Testfiles/CSVoffice_main.csv&quot;;&#xd;
WDS.log.info(filelocation);&#xd;
file1.sendKeys(new String[] {filelocation});&#xd;
}&#xd;
}&#xd;
}catch(Exception e)  &#xd;
{  &#xd;
    //Exception if there is problem in file upload.&#xd;
WDS.log.info(&quot;No Login upload&quot;);&#xd;
}&#xd;
&#xd;
&#xd;
WDS.log.info(&quot;Completed&quot;);&#xd;
WDS.sampleResult.sampleEnd();&#xd;
</stringProp>
            <stringProp name="WebDriverSampler.language">beanshell</stringProp>
          </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
          <hashTree/>
          <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="jp@gc - WebDriver Sampler" enabled="true">
            <stringProp name="WebDriverSampler.script">import org.apache.jmeter.services.FileServer;&#xd;
import org.openqa.selenium;&#xd;
import java.awt.Robot;&#xd;
import org.openqa.selenium.JavascriptExecutor;&#xd;
import org.openqa.selenium.interactions.Action;&#xd;
import org.openqa.selenium.interactions.Actions;&#xd;
import java.awt.Toolkit;&#xd;
import java.io;&#xd;
import java.io.File;&#xd;
import java.awt.datatransfer.StringSelection;&#xd;
import org.apache.commons.io.FileUtils;&#xd;
import org.openqa.selenium.OutputType;&#xd;
import org.openqa.selenium.TakesScreenshot;&#xd;
import org.openqa.selenium.firefox.FirefoxProfile;&#xd;
import java.time.temporal.ChronoUnit;&#xd;
import java.time.format.DateTimeFormatter;  &#xd;
import java.time.LocalDateTime;   &#xd;
import org.openqa.selenium.WebElement;&#xd;
import org.openqa.selenium.By;&#xd;
import java.io.FileReader;&#xd;
import java.io.BufferedReader;&#xd;
import java.io.FileWriter;&#xd;
import java.util.concurrent.TimeUnit;&#xd;
import java.util.ArrayList;&#xd;
import org.testng.asserts.SoftAssert;&#xd;
import java.util.List;&#xd;
import java.nio.file.Path;&#xd;
import java.nio.file.Paths;&#xd;
import org.openqa.selenium.support.ui.WebDriverWait;&#xd;
import org.openqa.selenium.support.ui.ExpectedConditions;&#xd;
WebDriverWait wait= new WebDriverWait(WDS.browser,10);&#xd;
WDS.sampleResult.sampleStart();&#xd;
var vars = org.apache.jmeter.threads.JMeterContextService.getContext().getVariables();&#xd;
&#xd;
try{&#xd;
    wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//ul[@class=&apos;menu-main&apos;]/child::li&quot;)));&#xd;
    wait.until(ExpectedConditions.elementToBeClickable(By.xpath(&quot;//ul[@class=&apos;menu-main&apos;]/child::li&quot;))).click();&#xd;
    start=LocalDateTime.now();&#xd;
    String currDir  = System.getProperty(&quot;user.dir&quot;);&#xd;
    File file =new File(currDir);&#xd;
    Thread.sleep(5000);&#xd;
    file1= WDS.browser.findElement(By.xpath(&quot;//input[contains(@class,&apos;fileSelectHiddenInput&apos;)]&quot;));&#xd;
&#xd;
WDS.browser.executeScript(&quot;document.querySelector(&apos;.fileSelectHiddenInput&apos;).setAttribute(&apos;style&apos;,display=&apos;block&apos;,&apos;opacity:1; width:10px; height:10px; z-index:100&apos;)&quot;,new Object[] {&quot;&quot;});&#xd;
String filelocation=&quot;C:\\Users\\Administrator\\Documents\\apache-jmeter-3.3\\bin\\Testfiles\\pngFileToTest.png&quot;;&#xd;
&#xd;
WDS.log.info(filelocation);&#xd;
file1.sendKeys(new String[] {filelocation});&#xd;
    WebDriverWait wait2= new WebDriverWait(WDS.browser,300);&#xd;
    oldTimeForProgress=LocalDateTime.now();&#xd;
&#xd;
try{&#xd;
    //checking for upload error message&#xd;
    wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//div[contains(@class,&apos;ui-notification&apos;)]//div[contains(@class,&apos;message&apos;)]&quot;))).isDisplayed();	&#xd;
    WDS.log.info(&quot;--------------------png file format not supported--------------------&quot;);&#xd;
    end=LocalDateTime.now();&#xd;
    	Long minutesBetween=ChronoUnit.MILLIS.between(start,end);&#xd;
    	vars.put(&quot;ErrorMessage&quot;,String.valueOf(minutesBetween));&#xd;
    wait.until(ExpectedConditions.elementToBeClickable(By.xpath(&quot;//div/button[@ng-click=&apos;$close()&apos;]&quot;))).click();&#xd;
    }catch(Exception e)&#xd;
    {&#xd;
    WDS.log.info(&quot;----------MSG NOT SHOWN---------&quot;);&#xd;
    wait.until(ExpectedConditions.elementToBeClickable(By.xpath(&quot;//div/button[@ng-click=&apos;$close()&apos;]&quot;))).click();&#xd;
    }&#xd;
}catch(Exception e)&#xd;
{&#xd;
	try {&#xd;
           InetAddress ipAddr = InetAddress.getLocalHost();&#xd;
           ip= String.valueOf(ipAddr.getHostAddress());&#xd;
            } catch (UnknownHostException ex) {&#xd;
                ex.printStackTrace();&#xd;
            }&#xd;
    File src= ((TakesScreenshot)WDS.browser).getScreenshotAs(OutputType.FILE);&#xd;
    try {&#xd;
     // now copy the  screenshot to desired location using copyFile //method&#xd;
        FileUtils.copyFile(src, new File(&quot;Reporting/&quot;+ip+&quot;UploadPng_Errormsg&quot;+vars.get(&quot;Itr&quot;)+&quot;i&quot;+vars.get(&quot;usr&quot;)+&quot;u&quot;+&quot;.png&quot;));&#xd;
    }&#xd;
    catch (IOException e)&#xd;
     {&#xd;
       WDS.log.info(&quot;something wrong&quot;);&#xd;
     }&#xd;
}&#xd;
&#xd;
try{&#xd;
    //User is trying to logout from the application&#xd;
    wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//div[@class=&apos;dropdown-toggle&apos;]/p&quot;))).click();&#xd;
    logout=wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//a[@class=&apos;logout&apos;]&quot;)));&#xd;
    start=LocalDateTime.now();&#xd;
    logout.click();&#xd;
    url=WDS.browser.getCurrentUrl();&#xd;
    wait.until(ExpectedConditions.visibilityOfElementLocated(By.xpath(&quot;//div/figure[@class=&apos;logo-mammoth text-hide&apos;]&quot;)));&#xd;
    end=LocalDateTime.now();&#xd;
    Long minutesBetween=ChronoUnit.MILLIS.between(start,end);&#xd;
    vars.put(&quot;logout&quot;,String.valueOf(minutesBetween));&#xd;
    WDS.log.info(vars.get(&quot;logout&quot;));&#xd;
}&#xd;
catch(Exception e)&#xd;
{&#xd;
try {&#xd;
           InetAddress ipAddr = InetAddress.getLocalHost();&#xd;
           ip= String.valueOf(ipAddr.getHostAddress());&#xd;
            } catch (UnknownHostException ex) {&#xd;
                ex.printStackTrace();&#xd;
            }&#xd;
    File src= ((TakesScreenshot)WDS.browser).getScreenshotAs(OutputType.FILE);&#xd;
    try {&#xd;
     // now copy the  screenshot to desired location using copyFile //method&#xd;
        FileUtils.copyFile(src, new File(&quot;Reporting/&quot;+ip+&quot;UploadPng_logout&quot;+vars.get(&quot;Itr&quot;)+&quot;i&quot;+vars.get(&quot;usr&quot;)+&quot;u&quot;+&quot;.png&quot;));&#xd;
    }&#xd;
    catch (IOException e)&#xd;
     {&#xd;
       WDS.log.info(&quot;something wrong&quot;);&#xd;
     }&#xd;
}&#xd;
finally&#xd;
{&#xd;
    f = new FileOutputStream(&quot;TimestampsFolder/Timestamp_FileUploadPngTest_.txt&quot;,true); &#xd;
    p = new PrintStream(f); &#xd;
    EndTime=LocalDateTime.now();&#xd;
    WDS.log.info(&quot; EndTime = &quot;+EndTime);&#xd;
    WDS.sampleResult.sampleEnd();&#xd;
    WDS.log.info(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: Overlay = &quot;+vars.get(&quot;overlay&quot;));&#xd;
    p.println(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: Overlay = &quot;+vars.get(&quot;overlay&quot;));&#xd;
    WDS.log.info(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: login = &quot;+vars.get(&quot;login&quot;));&#xd;
    p.println(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: login = &quot;+vars.get(&quot;login&quot;));&#xd;
    WDS.log.info(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: ErrorMessage = &quot;+vars.get(&quot;ErrorMessage&quot;));&#xd;
    p.println(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: ErrorMessage = &quot;+vars.get(&quot;ErrorMessage&quot;));&#xd;
    WDS.log.info(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: logout = &quot;+vars.get(&quot;logout&quot;));&#xd;
    p.println(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: logout = &quot;+vars.get(&quot;logout&quot;));&#xd;
    p.println(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: startTime = &quot;+vars.get(&quot;StartTime&quot;));&#xd;
    p.println(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: EndTime = &quot;+EndTime);&#xd;
    LocalDateTime StartTime = LocalDateTime.parse(vars.get(&quot;StartTime&quot;));&#xd;
    Long minutesBetween=ChronoUnit.MILLIS.between(StartTime,EndTime);&#xd;
    p.println(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: TotalTime = &quot;+minutesBetween);&#xd;
    WDS.log.info(&quot;Login: itrNO = &quot;+vars.get(&quot;Itr&quot;)+&quot;i: user = &quot;+vars.get(&quot;usr&quot;)+&quot;u: TotalTime = &quot;+minutesBetween);&#xd;
&#xd;
p.close();&#xd;
       &#xd;
}</stringProp>
            <stringProp name="WebDriverSampler.language">beanshell</stringProp>
          </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>